results/ai-scenario.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: ai-scenario.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m40s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 1m10s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/10 VUs  0m01.0s/1m10.0s

running (0m02.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 01/10 VUs  0m02.0s/1m10.0s

running (0m03.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 01/10 VUs  0m03.0s/1m10.0s

running (0m04.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 01/10 VUs  0m04.0s/1m10.0s

running (0m05.0s), 01/10 VUs, 1 complete and 0 interrupted iterations
default   [   7% ] 01/10 VUs  0m05.0s/1m10.0s

running (0m06.0s), 02/10 VUs, 1 complete and 0 interrupted iterations
default   [   9% ] 02/10 VUs  0m06.0s/1m10.0s

running (0m07.0s), 02/10 VUs, 2 complete and 0 interrupted iterations
default   [  10% ] 02/10 VUs  0m07.0s/1m10.0s

running (0m08.0s), 02/10 VUs, 2 complete and 0 interrupted iterations
default   [  11% ] 02/10 VUs  0m08.0s/1m10.0s

running (0m09.0s), 02/10 VUs, 3 complete and 0 interrupted iterations
default   [  13% ] 02/10 VUs  0m09.0s/1m10.0s

running (0m10.0s), 02/10 VUs, 4 complete and 0 interrupted iterations
default   [  14% ] 02/10 VUs  0m10.0s/1m10.0s

running (0m11.0s), 03/10 VUs, 4 complete and 0 interrupted iterations
default   [  16% ] 03/10 VUs  0m11.0s/1m10.0s

running (0m12.0s), 03/10 VUs, 5 complete and 0 interrupted iterations
default   [  17% ] 03/10 VUs  0m12.0s/1m10.0s

running (0m13.0s), 03/10 VUs, 6 complete and 0 interrupted iterations
default   [  19% ] 03/10 VUs  0m13.0s/1m10.0s

running (0m14.0s), 03/10 VUs, 7 complete and 0 interrupted iterations
default   [  20% ] 03/10 VUs  0m14.0s/1m10.0s

running (0m15.0s), 03/10 VUs, 8 complete and 0 interrupted iterations
default   [  21% ] 03/10 VUs  0m15.0s/1m10.0s

running (0m16.0s), 04/10 VUs, 9 complete and 0 interrupted iterations
default   [  23% ] 04/10 VUs  0m16.0s/1m10.0s

running (0m17.0s), 04/10 VUs, 10 complete and 0 interrupted iterations
default   [  24% ] 04/10 VUs  0m17.0s/1m10.0s

running (0m18.0s), 04/10 VUs, 11 complete and 0 interrupted iterations
default   [  26% ] 04/10 VUs  0m18.0s/1m10.0s

running (0m19.0s), 04/10 VUs, 13 complete and 0 interrupted iterations
default   [  27% ] 04/10 VUs  0m19.0s/1m10.0s

running (0m20.0s), 04/10 VUs, 15 complete and 0 interrupted iterations
default   [  29% ] 04/10 VUs  0m20.0s/1m10.0s

running (0m21.0s), 05/10 VUs, 16 complete and 0 interrupted iterations
default   [  30% ] 05/10 VUs  0m21.0s/1m10.0s

running (0m22.0s), 05/10 VUs, 17 complete and 0 interrupted iterations
default   [  31% ] 05/10 VUs  0m22.0s/1m10.0s

running (0m23.0s), 05/10 VUs, 19 complete and 0 interrupted iterations
default   [  33% ] 05/10 VUs  0m23.0s/1m10.0s

running (0m24.0s), 05/10 VUs, 21 complete and 0 interrupted iterations
default   [  34% ] 05/10 VUs  0m24.0s/1m10.0s

running (0m25.0s), 05/10 VUs, 23 complete and 0 interrupted iterations
default   [  36% ] 05/10 VUs  0m25.0s/1m10.0s

running (0m26.0s), 05/10 VUs, 24 complete and 0 interrupted iterations
default   [  37% ] 05/10 VUs  0m26.0s/1m10.0s

running (0m27.0s), 06/10 VUs, 26 complete and 0 interrupted iterations
default   [  39% ] 06/10 VUs  0m27.0s/1m10.0s

running (0m28.0s), 06/10 VUs, 28 complete and 0 interrupted iterations
default   [  40% ] 06/10 VUs  0m28.0s/1m10.0s

running (0m29.0s), 06/10 VUs, 29 complete and 0 interrupted iterations
default   [  41% ] 06/10 VUs  0m29.0s/1m10.0s

running (0m30.0s), 06/10 VUs, 33 complete and 0 interrupted iterations
default   [  43% ] 06/10 VUs  0m30.0s/1m10.0s

running (0m31.0s), 06/10 VUs, 34 complete and 0 interrupted iterations
default   [  44% ] 06/10 VUs  0m31.0s/1m10.0s

running (0m32.0s), 06/10 VUs, 36 complete and 0 interrupted iterations
default   [  46% ] 06/10 VUs  0m32.0s/1m10.0s

running (0m33.0s), 07/10 VUs, 39 complete and 0 interrupted iterations
default   [  47% ] 07/10 VUs  0m33.0s/1m10.0s

running (0m34.0s), 07/10 VUs, 40 complete and 0 interrupted iterations
default   [  49% ] 07/10 VUs  0m34.0s/1m10.0s

running (0m35.0s), 07/10 VUs, 43 complete and 0 interrupted iterations
default   [  50% ] 07/10 VUs  0m35.0s/1m10.0s

running (0m36.0s), 07/10 VUs, 46 complete and 0 interrupted iterations
default   [  51% ] 07/10 VUs  0m36.0s/1m10.0s

running (0m37.0s), 07/10 VUs, 47 complete and 0 interrupted iterations
default   [  53% ] 07/10 VUs  0m37.0s/1m10.0s

running (0m38.0s), 07/10 VUs, 48 complete and 0 interrupted iterations
default   [  54% ] 07/10 VUs  0m38.0s/1m10.0s

running (0m39.0s), 08/10 VUs, 53 complete and 0 interrupted iterations
default   [  56% ] 08/10 VUs  0m39.0s/1m10.0s

running (0m40.0s), 08/10 VUs, 55 complete and 0 interrupted iterations
default   [  57% ] 08/10 VUs  0m40.0s/1m10.0s

running (0m41.0s), 08/10 VUs, 55 complete and 0 interrupted iterations
default   [  59% ] 08/10 VUs  0m41.0s/1m10.0s

running (0m42.0s), 08/10 VUs, 61 complete and 0 interrupted iterations
default   [  60% ] 08/10 VUs  0m42.0s/1m10.0s

running (0m43.0s), 08/10 VUs, 63 complete and 0 interrupted iterations
default   [  61% ] 08/10 VUs  0m43.0s/1m10.0s

running (0m44.0s), 08/10 VUs, 66 complete and 0 interrupted iterations
default   [  63% ] 08/10 VUs  0m44.0s/1m10.0s

running (0m45.0s), 09/10 VUs, 69 complete and 0 interrupted iterations
default   [  64% ] 09/10 VUs  0m45.0s/1m10.0s

running (0m46.0s), 09/10 VUs, 71 complete and 0 interrupted iterations
default   [  66% ] 09/10 VUs  0m46.0s/1m10.0s

running (0m47.0s), 09/10 VUs, 76 complete and 0 interrupted iterations
default   [  67% ] 09/10 VUs  0m47.0s/1m10.0s

running (0m48.0s), 09/10 VUs, 79 complete and 0 interrupted iterations
default   [  69% ] 09/10 VUs  0m48.0s/1m10.0s

running (0m49.0s), 09/10 VUs, 80 complete and 0 interrupted iterations
default   [  70% ] 09/10 VUs  0m49.0s/1m10.0s

running (0m50.0s), 09/10 VUs, 85 complete and 0 interrupted iterations
default   [  71% ] 09/10 VUs  0m50.0s/1m10.0s

running (0m51.0s), 10/10 VUs, 88 complete and 0 interrupted iterations
default   [  73% ] 10/10 VUs  0m51.0s/1m10.0s

running (0m52.0s), 10/10 VUs, 89 complete and 0 interrupted iterations
default   [  74% ] 10/10 VUs  0m52.0s/1m10.0s

running (0m53.0s), 10/10 VUs, 95 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  0m53.0s/1m10.0s

running (0m54.0s), 09/10 VUs, 99 complete and 0 interrupted iterations
default   [  77% ] 09/10 VUs  0m54.0s/1m10.0s

running (0m55.0s), 09/10 VUs, 102 complete and 0 interrupted iterations
default   [  79% ] 09/10 VUs  0m55.0s/1m10.0s

running (0m56.0s), 09/10 VUs, 105 complete and 0 interrupted iterations
default   [  80% ] 09/10 VUs  0m56.0s/1m10.0s

running (0m57.0s), 08/10 VUs, 108 complete and 0 interrupted iterations
default   [  81% ] 08/10 VUs  0m57.0s/1m10.0s

running (0m58.0s), 08/10 VUs, 112 complete and 0 interrupted iterations
default   [  83% ] 08/10 VUs  0m58.0s/1m10.0s

running (0m59.0s), 07/10 VUs, 114 complete and 0 interrupted iterations
default   [  84% ] 07/10 VUs  0m59.0s/1m10.0s

running (1m00.0s), 07/10 VUs, 116 complete and 0 interrupted iterations
default   [  86% ] 07/10 VUs  1m00.0s/1m10.0s

running (1m01.0s), 05/10 VUs, 121 complete and 0 interrupted iterations
default   [  87% ] 05/10 VUs  1m01.0s/1m10.0s

running (1m02.0s), 05/10 VUs, 121 complete and 0 interrupted iterations
default   [  89% ] 05/10 VUs  1m02.0s/1m10.0s

running (1m03.0s), 05/10 VUs, 123 complete and 0 interrupted iterations
default   [  90% ] 05/10 VUs  1m03.0s/1m10.0s

running (1m04.0s), 04/10 VUs, 126 complete and 0 interrupted iterations
default   [  91% ] 04/10 VUs  1m04.0s/1m10.0s

running (1m05.0s), 04/10 VUs, 126 complete and 0 interrupted iterations
default   [  93% ] 04/10 VUs  1m05.0s/1m10.0s

running (1m06.0s), 04/10 VUs, 128 complete and 0 interrupted iterations
default   [  94% ] 04/10 VUs  1m06.0s/1m10.0s

running (1m07.0s), 03/10 VUs, 130 complete and 0 interrupted iterations
default   [  96% ] 03/10 VUs  1m07.0s/1m10.0s

running (1m08.0s), 02/10 VUs, 132 complete and 0 interrupted iterations
default   [  97% ] 02/10 VUs  1m08.0s/1m10.0s

running (1m09.0s), 02/10 VUs, 132 complete and 0 interrupted iterations
default   [  99% ] 02/10 VUs  1m09.0s/1m10.0s

running (1m10.0s), 02/10 VUs, 133 complete and 0 interrupted iterations
default   [ 100% ] 02/10 VUs  1m10.0s/1m10.0s

running (1m11.0s), 01/10 VUs, 134 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/10 VUs  1m10s

running (1m12.0s), 01/10 VUs, 134 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/10 VUs  1m10s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<540' p(95)=329.36ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 270     3.747673/s
    checks_succeeded...: 100.00% 270 out of 270
    checks_failed......: 0.00%   0 out of 270

    ✓ home status 200
    ✓ news status 200

    HTTP
    http_req_duration..............: avg=206.26ms min=74.7ms med=276.51ms max=604.77ms p(90)=313.25ms p(95)=329.36ms
      { expected_response:true }...: avg=206.26ms min=74.7ms med=276.51ms max=604.77ms p(90)=313.25ms p(95)=329.36ms
    http_req_failed................: 0.00%  0 out of 540
    http_reqs......................: 540    7.495345/s

    EXECUTION
    iteration_duration.............: avg=2.89s    min=2.74s  med=2.8s     max=4.03s    p(90)=3.08s    p(95)=3.61s   
    iterations.....................: 135    1.873836/s
    vus............................: 1      min=1        max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 875 kB 12 kB/s
    data_sent......................: 90 kB  1.2 kB/s



running (1m12.0s), 00/10 VUs, 135 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  1m10s